In [2]:
import requests  
import pandas as pd
from sqlalchemy import create_engine

In [3]:
dfs = pd.read_html("https://honey.com/honey-industry/statistics/retail-honey-price")

In [4]:
honey_prices = dfs[0]

In [5]:
honey_prices2 = honey_prices.rename(columns={"Unnamed: 0": "year"})

In [6]:
honey_3 = honey_prices2.rename(str.lower, axis='columns')

In [7]:
honey_prices_4 = honey_3.rename(columns={"dev": "dec"})

In [8]:
honey_prices_5 = honey_prices_4[honey_prices_4.columns].replace({'\$':''}, regex = True)

In [9]:
honey_prices_5.fillna('7.89',inplace=True)

In [27]:
honey_prices_5

,year,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec
0,2020,8.03,7.88,7.95,7.90,8.09,7.89,7.93,7.83,7.95,7.61,7.76,7.89
1,2019,7.28,7.54,7.86,7.66,7.66,7.72,7.68,7.62,7.89,7.71,7.85,8.08
2,2018,7.57,7.22,7.34,7.28,7.03,7.23,7.37,7.41,7.17,7.34,7.51,7.46
3,2017,7.35,6.99,6.85,7.04,7.06,7.25,7.05,7.26,7.27,7.37,7.18,7.25
4,2016,6.74,6.91,6.79,6.79,6.72,7.12,7.01,6.88,6.88,7.12,7.04,7.39
5,2015,6.65,6.43,6.57,6.49,6.52,6.56,6.73,6.75,6.63,6.69,6.92,6.79
6,2014,5.98,6.17,6.17,6.04,6.40,6.32,6.18,6.32,6.37,6.38,6.31,6.34
7,2013,5.67,5.83,5.68,5.73,5.87,5.81,6.00,5.97,5.82,5.97,5.92,6.04
8,2012,5.26,5.43,5.42,5.56,5.65,5.32,5.67,5.59,5.73,5.57,5.63,5.78
9,2011,4.94,5.02,5.10,5.22,5.19,5.04,5.23,5.17,5.17,5.23,5.22,5.31
10,2010,4.82,4.62,4.73,4.60,4.66,4.81,4.91,5.04,4.98,4.91,5.08,5.06

In [28]:
engine = create_engine(f"sqlite:///the_hive.db")

In [29]:
honey_prices_5.to_sql(name = 'honey_prices', con = engine, if_exists='replace', index=False)

In [30]:
engine.table_names()

['honey_prices']

In [31]:
honey_prices_5.melt()

    variable value
0       year  2020
1       year  2019
2       year  2018
3       year  2017
4       year  2016
..       ...   ...
138      dec  6.34
139      dec  6.04
140      dec  5.78
141      dec  5.31
142      dec  5.06

[143 rows x 2 columns]